[
  {
    "Name": "Casio Triple Sensor Version 3 PRO TREK PRG600Y-1D",
    "Description": "2 Year Casio Australia Warranty Case / bezel material: Resin / Stainless steel Silicon band Mineral Glass Neobrite Screw Lock Crown 100-meter water resistance Double LED light LED light for the face (Full auto LED light, selectable illumination duration, afterglow) LED backlight for the digital display (Full auto LED light, selectable illumination duration, afterglow) Solar powered Low-temperature resistant (-10°C/14 °F) ",
    "Price": 476.48,
    "PictureUrl": "images/products/ca-res1.png",
    "ProductTypeId": 1,
    "ProductBrandId": 1
  },
  {
    "Name": "Casio MRW-200H-3B mens quartz watch",
    "Description": "2 Year Casio Australia Warranty Gender: Mens Style: Sports Type of movement: Quartz Powered by: Quartz Movement manufacturer: Japanese Calendar type: Day-and-date Water resistance: 100m | 10 ATM Display type: Analog Case color: Black ",
    "Price": 53.01,
    "PictureUrl": "images/products/ca-res2.png",
    "ProductTypeId": 1,
    "ProductBrandId": 1
  },
  {
    "Name": "CASIO ILLUMINATOR WORLD TIME ALARM DIGITAL AE-1000W-3AV MEN'S WATCH",
    "Description": "Case / Bezel Material: Resin Resin Strap Resin/Spherical Crystal 10 Years Battery World Map For World Time Multi Time (4 Different Cities) 1/100-Second Stopwatch World Time 31 Time Zones (48 Cities + UTC) Countdown Timer 5 Daily Alarms LED Light Afterglow Hourly Time Signal ",
    "Price": 63.66,
    "PictureUrl": "images/products/ca-rub1.png",
    "ProductTypeId": 3,
    "ProductBrandId": 1
  },
  {
    "Name": "CASIO MQ24-1B3 WITH BLACK RUBBER BAND MEN'S WATCH",
    "Description": "Item Shape Round Dial window material type Resin Glass Display Type Analog Clasp Buckle Case material Resin Case diameter 35 millimeters Case Thickness 8 millimeters Band Material Rubber Band length mens Band width 22 millimeters Band Color Black ",
    "Price": 53.06,
    "PictureUrl": "images/products/ca-rub2.png",
    "ProductTypeId": 3,
    "ProductBrandId": 1
  },
  {
    "Name": "Citizen Chronograph Men's Watch CA7010-19E",
    "Description": "In addition to accuracy ensured via the chronograph, the performance of this watch is powered by Eco-Drive, obtaining energy from any light source and eliminating the need for batteries. Featuring WR100 with a multi dial as well as date display. Constructed with stainless steel with a black dial as well as the black leather strap, this watch is as sharp on looks as it is on performance. Caliber number B642. ",
    "Price": 317.30,
    "PictureUrl": "images/products/ci-lea1.png",
    "ProductTypeId": 2,
    "ProductBrandId": 2
  },
  {
    "Name": "Citizen Promaster Marine Men's Watch BX1010-11L",
    "Description": "Revamped and reinvented, the antique styled Citizen Promaster Nighthawk is here to stay. Featuring world time in 26 time zones, perpetual calendar, anti-shock and date in a stainless steel case, coffee brown leather strap with yellow contrast stitching and royal blue dial. Featuring our Eco-Drive technology – powered by light, any light. Never needs a battery. Caliber number E784.",
    "Price": 412.81,
    "PictureUrl": "images/products/ci-lea2.png",
    "ProductTypeId": 2,
    "ProductBrandId": 2
  },
  {
    "Name": "Citizen Eco Drive BU2023-12E",
    "Description": "Everyday challenges make reliability a prized attribute both in life and in desiging quality watches. Delivering dependability through passionate craftsmanship and functional efficiency, this watch is built from durable stainless steel and Oxhide leather band and has WR100, giving you confidence of accuracy whether at work or in the surf. With Eco-Drive technology, it gathers power from just about any light source while also having a 6 month backup power capacity, efficiently cementing its reliability status.",
    "Price": 455.25,
    "PictureUrl": "images/products/ci-lea3.png",
    "ProductTypeId": 2,
    "ProductBrandId": 2
  },
  {
    "Name": "Citizen Promaster Marine Men's Watch BN2038-01L",
    "Description": "Ready, Set, Dive. An iconic name with a reinvented construction, the Citizen Promaster Aqualand ISO compliant watch with maximum depth memory, rapid ascent alarm, auto start dive mode and power reserve indicator with divers 200M, you won't want anything else when headed to the ocean. Stainless steel case compliment the ocean blue polyurethane strap and blue dial with blue and red bezel. Featuring our Eco-Drive technology – powered by light, any light. Never needs a battery. Caliber number J250. ",
    "Price": 954.02,
    "PictureUrl": "images/products/ci-rub1.png",
    "ProductTypeId": 3,
    "ProductBrandId": 2
  },
  {
    "Name": "Citizen Promaster Marine Men's Watch CA0718-13E",
    "Description": "Proof that a dive watch can be fun & functional with the Citizen ISO-compliant Citizen Promaster Chrono Diver. With Eco-Drive technology, it is powered by light and never needs a battery, so you'll never need to open your caseback or compromise your dive again. This timepiece features a stainless steel case, black polyurethane strap with black dial, one-way rotating elapsed time, 1/5th-second chronograph, 12/24-hour time, date and divers 200M. Caliber number B612.",
    "Price": 370.36,
    "PictureUrl": "images/products/ci-rub2.png",
    "ProductTypeId": 3,
    "ProductBrandId": 2
  },
  {
    "Name": "Diesel MS9 Gunmetal Chronograph Men's Watch DZ4528",
    "Description": "Case Diameter 48 millimetres Case Thickness 10.00 Band Material Stainless Steel Band Length Men's Standard Band Width 22 millimetres Band Colour Grey Dial Colour grey Bezel Material Stainless Steel Bezel Function Unidirectional Special Features Alarm, Waterproof Movement Chronograph Water Pressure Resistance 3.00 atmosphere ",
    "Price": 306.69,
    "PictureUrl": "images/products/di-stn1.png",
    "ProductTypeId": 4,
    "ProductBrandId": 3
  },
  {
    "Name": "Diesel Mr Daddy 2.0 Men's Watch",
    "Description": "Black stainless steel case with a blue stainless steel bracelet. Fixed black stainless steel bezel. Grey dial with silver-tone hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands. Date display at the 3 o'clock position. Chronograph - sub-dials displaying: three - 60 second, 30 minute and 24 hour. Quartz movement. Scratch resistant mineral crystal. Pull / push crown. Solid case back. ",
    "Price": 15,
    "PictureUrl": "images/products/di-stn2.png",
    "ProductTypeId": 4,
    "ProductBrandId": 3
  },
  {
    "Name": "Fossil Minimalist Men's Watch Set FS5557",
    "Description": "44 MM black dial in stainless steel case with a thickness of 8 MM Brown leather 22 MM wide strap Water resistant to 5 ATM: In general, suitable for short periods of exposure to water i.e washing hands or showering/bathing. Not suitable for recreational swimming, diving or snorkeling Round watch with Quartz movement type ",
    "Price": 200.57,
    "PictureUrl": "images/products/fo-lea1.png",
    "ProductTypeId": 2,
    "ProductBrandId": 4
  },
  {
    "Name": "Fossil The Commuter Auto Analog Blue Dial Men's Watch",
    "Description": "Model Number ME3159 Part Number ME3159 Band Colour Brown Band Material Leather Band Width 22 Millimeters Bezel Material Stainless Steel Brand Fossil Case Diameter 42 Millimeters Case Material Stainless Steel Case Thickness 13 Millimeters Clasp Buckle",
    "Price": 323.67,
    "PictureUrl": "images/products/fo-lea2.png",
    "ProductTypeId": 2,
    "ProductBrandId": 4
  },
  {
    "Name": "FOSSIL MACHINE BLACK DIAL CHRONOGRAPH MEN'S WATCH",
    "Description": "Band Colour Black Band Material Silicone Band Width 24 Millimeters Brand Fossil Case Diameter 45 Millimeters Case Thickness 12 Millimeters Dial Colour Black Display Type Analog Case Shape Round Item Weight 249 Grams",
    "Price": 201.63,
    "PictureUrl": "images/products/fo-rub1.png",
    "ProductTypeId": 3,
    "ProductBrandId": 4
  },
  {
    "Name": "Fossil Grant Men's Watch FS4736IE",
    "Description": "Case size: 44mm; Band size: 22mm; quartz movement with luminous 3-hand analog display; mineral crystal face; imported Round stainless steel case with black dial and Roman numerals Stainless steel band with deployment clasp closure; interchangeable with all Fossil 22mm watch straps Multifunction watch with stopwatch functionality; three separate dials to track hours, minutes and seconds; timer; 24 hour ",
    "Price": 200.57,
    "PictureUrl": "images/products/fo-stn1.png",
    "ProductTypeId": 4,
    "ProductBrandId": 4
  },
  {
    "Name": "Fossil Analog Mother of Pearl Dial Men's Watch",
    "Description": "Model Number FS5572 Part Number FS5572 Band Colour Multi-Colour Band Material Stainless Steel Band Width 22 Millimeters Bezel Material Stainless Steel Brand Fossil Case Diameter 44 Millimeters Case Material Stainless Steel Case Thickness 8 Millimeters Clasp Fold-over Clasp",
    "Price": 221.79,
    "PictureUrl": "images/products/fo-stn2.png",
    "ProductTypeId": 4,
    "ProductBrandId": 4
  },
  {
    "Name": "G-Shock GA400GB-1A Men's Watch",
    "Description": "bezel material: Resin Resin Band Magnetic Resistant Shock Resistant Mineral Glass 200-meter water resistance LED light Auto light switch, selectable illumination duration (1.5 seconds or 3 seconds), afterglow World time 31 time zones (48 cities + coordinated universal time), one-touch UTC time zone, daylight saving on/off, Home city/World time city swapping 1/100-second stopwatch ",
    "Price": 232.40,
    "PictureUrl": "images/products/gs-ras1.png",
    "ProductTypeId": 1,
    "ProductBrandId": 5
  },
  {
    "Name": "Timex Marathon Digital Dial Silicone Strap Men's Watch",
    "Description": "Model number TW5M21000 Part Number TW5M21000 Item Shape Round Dial window material type Acrylic Display Type Digital Clasp Type Buckle Case material Plastic Case diameter 50 millimetres Case Thickness 16 millimetres Band Material Silicone Band length Men's Standard Band width 21 millimetres",
    "Price": 63.66,
    "PictureUrl": "images/products/ti-rub1.png",
    "ProductTypeId": 3,
    "ProductBrandId": 6
  }
]